0.57.2119-1/Catalogs/ККСНГ_ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_ЗначенияСвойствОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>XMLЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_ЗначенияСвойствОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Получает ссылку на объект справочника "ККСНГ_ЗначенияСвойствОбъектов" соответствующего некоему объекту основной конфигурации.
// Поиск производится по типу объекта и GUID, если объект не найден, то будет создан новый.
//
// Параметры:
//	СсылкаНаОбъект - СправочникСсылка.*, ДокументСсылка.* - Ссылка на объект основной конфигурации 
//
// Возвращаемое значение: 
//	ЗначениеСвойстваСсылка - СправочникСсылка.ККСНГ_ЗначенияСвойствОбъектов, Неопределено
//
Функция ПолучитьСсылкуЗначенияСвойства(СсылкаНаОбъект) Экспорт

	ЗначениеСвойстваСсылка = Неопределено;
	XMLТипЗнч = XMLТипЗнч(СсылкаНаОбъект);
	
	Если XMLТипЗнч <> Неопределено 
		И ЗначениеЗаполнено(СсылкаНаОбъект)
		И (СтрНайти(XMLТипЗнч.ИмяТипа, "DocumentRef.") 
			ИЛИ СтрНайти(XMLТипЗнч.ИмяТипа, "CatalogRef.")) Тогда
		
		ТипСтрокой = СтрЗаменить(XMLТипЗнч.ИмяТипа, "DocumentRef.", "Документ.");
		ТипСтрокой = СтрЗаменить(ТипСтрокой, 		"CatalogRef.", "Справочник.");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ККСНГ_ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ККСНГ_ЗначенияСвойствОбъектов КАК ККСНГ_ЗначенияСвойствОбъектов
		               |ГДЕ
		               |	ККСНГ_ЗначенияСвойствОбъектов.GUID = &СтрокаGUID
		               |	И ККСНГ_ЗначенияСвойствОбъектов.ТипСтрокой = &ТипСтрокой";
		
		СтрокаGUID = XMLСтрока(СсылкаНаОбъект);
				
		Запрос.УстановитьПараметр("СтрокаGUID", СтрокаGUID);
		Запрос.УстановитьПараметр("ТипСтрокой", ТипСтрокой);
			
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ЗначениеСвойстваСсылка = ЗаписатьЗначениеСвойства(СсылкаНаОбъект, СтрокаGUID, ТипСтрокой)	
		Иначе
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			ВыборкаЗапроса.Следующий();
			ЗначениеСвойстваСсылка = ВыборкаЗапроса.Ссылка;
			
		КонецЕсли;	
	
	КонецЕсли;

	Возврат ЗначениеСвойстваСсылка; 
	
КонецФункции

// Создает новый элемент справочника "ККСНГ_ЗначенияСвойствОбъектов", соответствующего некоему объекту основной конфигурации 
// и возвращает ссылку на созданный объект.
//
// Параметры:
//	СправочникСсылка -  СправочникСсылка.*, ДокументСсылка.* - Ссылка на объект основной конфигурации
//  СтрокаGUID     - Строка - Уникальный идентификатор объекта основной конфигурации строкой.
//  ТипСтрокой     - Строка - Тип объекта основной конфигурации строкой. 
//
// Возвращаемое значение: 
//	ЗначениеСвойстваСсылка - СправочникСсылка.ККСНГ_ЗначенияСвойствОбъектов, Неопределено
//
Функция ЗаписатьЗначениеСвойства(СправочникСсылка, СтрокаGUID, ТипСтрокой) Экспорт
	
	// TODO Обработка ошибок
	ЗначениеСвойстваСсылка = Неопределено;
	
	Попытка
		
		XMLЗначение = ККСНГ_XDTOКлиентСервер.СериализоватьВXML(СправочникСсылка);
		
		ОбъектЗначенияСвойства = Справочники.ККСНГ_ЗначенияСвойствОбъектов.СоздатьЭлемент();
		ОбъектЗначенияСвойства.XMLЗначение = XMLЗначение;
		ОбъектЗначенияСвойства.GUID = СтрокаGUID;
		ОбъектЗначенияСвойства.ТипСтрокой = ТипСтрокой;
		ОбъектЗначенияСвойства.Наименование = ТипСтрокой + "_" + Строка(СправочникСсылка);
		
		ОбъектЗначенияСвойства.Записать();
		
		ЗначениеСвойстваСсылка = ОбъектЗначенияСвойства.Ссылка;
				
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат ЗначениеСвойстваСсылка;
	
КонецФункции

// Получает соответствующую ссылку на объект основной конфигурации из свойства объекта или ссылки с типом "ККСНГ_ЗначенияСвойствОбъектов".
//
// Параметры:
//	СсылкаИлиОбъект - СправочникСсылка.*, ДокументСсылка.*, СправочникОбъект.*, ДокументОбъект.*  - ссылка или объект расширения
//  ИмяСвойства     - Строка - Имя свойства ссылки или объекта расширения, в котором содержится значение с типом "СправочникСсылка.ККСНГ_ЗначенияСвойствОбъектов"
//
// Возвращаемое значение: 
//	ЗначениеРеквизита - ЛюбаяСсылка, Неопределено - Ссылка на объект основной конфигурации
//
Функция ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(СсылкаИлиОбъект, ИмяСвойства) Экспорт
	
	// TODO Сделать проверку переданных параметров, проверку наличия реквизита
	Попытка
		
		ЗначениеРеквизитаСсылка = СсылкаИлиОбъект[ИмяСвойства];
		
		ЗначениеРеквизита = ПолучитьСсылкуОбъектаПоЗначениюСвойства(ЗначениеРеквизитаСсылка);
		
	Исключение
		ЗначениеРеквизита = Неопределено;
		
	КонецПопытки;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

// Получает соответствующую ссылку на объект основной конфигурации из ссылки с типом "ККСНГ_ЗначенияСвойствОбъектов".
//
// Параметры:
//	ЗначениеСвойстваСсылка - СправочникСсылка.ККСНГ_ЗначенияСвойствОбъектов  - ссылка на значение свойства в расширении
//
// Возвращаемое значение: 
//	СсылкаНаОбъект - СправочникСсылка.*, ДокументСсылка.* - Ссылка на объект основной конфигурации
//
Функция ПолучитьСсылкуОбъектаПоЗначениюСвойства(ЗначениеСвойстваСсылка) Экспорт
	
	СсылкаНаОбъект = Неопределено;
	
	Если ТипЗнч(ЗначениеСвойстваСсылка) = Тип("СправочникСсылка.ККСНГ_ЗначенияСвойствОбъектов") Тогда
					
		Попытка
			СсылкаНаОбъект = ККСНГ_XDTOКлиентСервер.ДесериализоватьИзXML(ЗначениеСвойстваСсылка.XMLЗначение);
			
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

#КонецОбласти

#КонецЕсли
